# Order List Example Using Pandas Joins

This is an extended example based on the example originally in notebook 3.1.  

Here we are modeling a simple order system.  A store stocks SKUs (stock keeping units -- i.e., "things" that people buy).  Customers place orders and orders contain items.  In a system like this, the data are stored in separate tables that are combined for analysis and reporting.

In [1]:
import numpy as np
import pandas as pd
np.__version__, pd.__version__

('1.18.5', '1.0.5')

## Manually Create the DataFrames
See the bottom of the notebook for code that reads the DataFrames from csv files.

In [2]:
# Customer list.  Note that this data would normally be stored in a data file (e.g., a csv file)
# or database table.  For simplicty, we'll build it here instead:
customers = pd.DataFrame({
     'customer_id' : [  'C01',     'C02',        'C03',    'C04',        'C05',      'C06',     'C07',    'C08']
    ,  'last_name' : [ 'Smith',  'Jones',    'Johnson',  'Black',      'Green',    'Kholm',  'Tester',  'Krock']
    , 'first_name' : [  'Jeff',   'Kale',       'Cara',  'Linda',     'Howard',    'Genie',    'John', 'Barbra']
    ,       'city' : ['Auburn', 'Mobile', 'Birmingham', 'Dothan', 'Greenville', 'Norcross', 'Columbus','Selina']
    ,      'state' : [    'AL',     'AL',         'AL',     'AL',         'AL',       'GA',       'OH',    'KS']
})
customers

  customer_id last_name first_name        city state
0         C01     Smith       Jeff      Auburn    AL
1         C02     Jones       Kale      Mobile    AL
2         C03   Johnson       Cara  Birmingham    AL
3         C04     Black      Linda      Dothan    AL
4         C05     Green     Howard  Greenville    AL
5         C06     Kholm      Genie    Norcross    GA
6         C07    Tester       John    Columbus    OH
7         C08     Krock     Barbra      Selina    KS

In [3]:
# SKU List - the item (SKU) information.
skus = pd.DataFrame({
      'sku' : [   'A100',    'A109',    'A200',    'A227',    'A300',    'A876',    'A904',   'A1021',   'A1776'],
    'descr' : ['Widget1', 'Widget2', 'Widget3', 'Widget4', 'Widget5', 'Widget6', 'Widget7', 'Widget8', 'Widget9'],
     'cost' : [    12.50,    423.50,      6.50,      6.34,   1850.45,      3.23,      7.50,     18.55,    127.22]})
skus

     sku    descr     cost
0   A100  Widget1    12.50
1   A109  Widget2   423.50
2   A200  Widget3     6.50
3   A227  Widget4     6.34
4   A300  Widget5  1850.45
5   A876  Widget6     3.23
6   A904  Widget7     7.50
7  A1021  Widget8    18.55
8  A1776  Widget9   127.22

In [4]:
# Order List
orders = pd.DataFrame({
           'order' : [       123,        456,        789,        823,        950,       1024,       1223,       1552]
    ,'customer_id' : [     'C01',      'C05',      'C04',      'C01',      'C03',      'C03',      'C06',      'C02']
    , 'order_date' : ['01/07/17', '01/09/17', '01/09/17', '01/10/17', '01/15/17', '01/16/17', '01/16/17', '01/17/17']
})
orders

   order customer_id order_date
0    123         C01   01/07/17
1    456         C05   01/09/17
2    789         C04   01/09/17
3    823         C01   01/10/17
4    950         C03   01/15/17
5   1024         C03   01/16/17
6   1223         C06   01/16/17
7   1552         C02   01/17/17

In [5]:
# And we have a separate dataframe with the items in each order
items = pd.DataFrame({
        'order' : [   123,    123,    123,    456,    456,    789,    823,     950,    950,   1024, 1223, 1223, 1552],
          'sku' : ['A109', 'A100', 'A200', 'A109', 'A227', 'A109', 'A100',  'A300', 'A904', 'A200', 'A300', 'A1021', 'A876'],
        'price' : [765.55, 227.83,  12.50, 665.55,  10.68, 760.00, 225.55, 2650.55,  15.22,  12.25, 10.25, 17.50, 42.75]})
items

    order    sku    price
0     123   A109   765.55
1     123   A100   227.83
2     123   A200    12.50
3     456   A109   665.55
4     456   A227    10.68
5     789   A109   760.00
6     823   A100   225.55
7     950   A300  2650.55
8     950   A904    15.22
9    1024   A200    12.25
10   1223   A300    10.25
11   1223  A1021    17.50
12   1552   A876    42.75

In [6]:
# First, join (merge) the customers with the orders
pd.merge(customers,orders)
# Why not store all of this information in a single file?

  customer_id last_name first_name        city state  order order_date
0         C01     Smith       Jeff      Auburn    AL    123   01/07/17
1         C01     Smith       Jeff      Auburn    AL    823   01/10/17
2         C02     Jones       Kale      Mobile    AL   1552   01/17/17
3         C03   Johnson       Cara  Birmingham    AL    950   01/15/17
4         C03   Johnson       Cara  Birmingham    AL   1024   01/16/17
5         C04     Black      Linda      Dothan    AL    789   01/09/17
6         C05     Green     Howard  Greenville    AL    456   01/09/17
7         C06     Kholm      Genie    Norcross    GA   1223   01/16/17

In [7]:
# We'd like to join (merge) the data so that the item information can be 
# easily combined with the order information.
pd.merge(pd.merge(customers,orders), items)

,customer_id,last_name,first_name,city,state,order,order_date,sku,price
0,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A109,765.55
1,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A100,227.83
2,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A200,12.50
3,C01,Smith,Jeff,Auburn,AL,823,01/10/17,A100,225.55
4,C02,Jones,Kale,Mobile,AL,1552,01/17/17,A876,42.75
5,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A300,2650.55
6,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A904,15.22
7,C03,Johnson,Cara,Birmingham,AL,1024,01/16/17,A200,12.25
8,C04,Black,Linda,Dothan,AL,789,01/09/17,A109,760.00
9,C05,Green,Howard,Greenville,AL,456,01/09/17,A109,665.55
10,C05,Green,Howard,Greenville,AL,456,01/09/17,A227,10.68
11,C06,Kholm,Genie,Norcross,GA,1223,01/16/17,A300,10.25
12,C06,Kholm,Genie,Norcross,GA,1223,01/16/17,A1021,17.50

In [8]:
# And now add in the item/SKU information (and save the resulting dataframe)
sales = pd.merge(pd.merge(pd.merge(customers,orders), items),skus)
sales

,customer_id,last_name,first_name,city,state,order,order_date,sku,price,descr,cost
0,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A109,765.55,Widget2,423.50
1,C04,Black,Linda,Dothan,AL,789,01/09/17,A109,760.00,Widget2,423.50
2,C05,Green,Howard,Greenville,AL,456,01/09/17,A109,665.55,Widget2,423.50
3,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A100,227.83,Widget1,12.50
4,C01,Smith,Jeff,Auburn,AL,823,01/10/17,A100,225.55,Widget1,12.50
5,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A200,12.50,Widget3,6.50
6,C03,Johnson,Cara,Birmingham,AL,1024,01/16/17,A200,12.25,Widget3,6.50
7,C02,Jones,Kale,Mobile,AL,1552,01/17/17,A876,42.75,Widget6,3.23
8,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A300,2650.55,Widget5,1850.45
9,C06,Kholm,Genie,Norcross,GA,1223,01/16/17,A300,10.25,Widget5,1850.45
10,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A904,15.22,Widget7,7.50
11,C05,Green,Howard,Greenville,AL,456,01/09/17,A227,10.68,Widget4,6.34
12,C06,Kholm,Genie,Norcross,GA,1223,01/16/17,A1021,17.50,Widget8,18.55

In [9]:
# now that we have the data we need, let's add a calculated column
sales['profit'] = sales['price'] - sales['cost']
sales

,customer_id,last_name,first_name,city,state,order,order_date,sku,price,descr,cost,profit
0,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A109,765.55,Widget2,423.50,342.05
1,C04,Black,Linda,Dothan,AL,789,01/09/17,A109,760.00,Widget2,423.50,336.50
2,C05,Green,Howard,Greenville,AL,456,01/09/17,A109,665.55,Widget2,423.50,242.05
3,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A100,227.83,Widget1,12.50,215.33
4,C01,Smith,Jeff,Auburn,AL,823,01/10/17,A100,225.55,Widget1,12.50,213.05
5,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A200,12.50,Widget3,6.50,6.00
6,C03,Johnson,Cara,Birmingham,AL,1024,01/16/17,A200,12.25,Widget3,6.50,5.75
7,C02,Jones,Kale,Mobile,AL,1552,01/17/17,A876,42.75,Widget6,3.23,39.52
8,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A300,2650.55,Widget5,1850.45,800.10
9,C06,Kholm,Genie,Norcross,GA,1223,01/16/17,A300,10.25,Widget5,1850.45,-1840.20
10,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A904,15.22,Widget7,7.50,7.72
11,C05,Green,Howard,Greenville,AL,456,01/09/17,A227,10.68,Widget4,6.34,4.34
12,C06,Kholm,Genie,Norcross,GA,1223,01/16/17,A1021,17.50,Widget8,18.55,-1.05

In [10]:
# Grab all my stuff ...
sales[sales.first_name == 'Jeff']

,customer_id,last_name,first_name,city,state,order,order_date,sku,price,descr,cost,profit
0,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A109,765.55,Widget2,423.5,342.05
3,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A100,227.83,Widget1,12.5,215.33
4,C01,Smith,Jeff,Auburn,AL,823,01/10/17,A100,225.55,Widget1,12.5,213.05
5,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A200,12.50,Widget3,6.5,6.00

In [11]:
# Total the profit ... How does this work (i.e., can you explain steps?
# What an awesome test question this would be ... :-)).
sales[sales.first_name == 'Jeff'].profit.sum()

776.4300000000001

In [12]:
# All items sold with profit > 250
sales[sales.profit > 250]

,customer_id,last_name,first_name,city,state,order,order_date,sku,price,descr,cost,profit
0,C01,Smith,Jeff,Auburn,AL,123,01/07/17,A109,765.55,Widget2,423.50,342.05
1,C04,Black,Linda,Dothan,AL,789,01/09/17,A109,760.00,Widget2,423.50,336.50
8,C03,Johnson,Cara,Birmingham,AL,950,01/15/17,A300,2650.55,Widget5,1850.45,800.10

In [13]:
# What if we use a left join on the second merge/join ...
a = pd.merge(skus, pd.merge(pd.merge(customers,orders), items), how="left")
a

,sku,descr,cost,customer_id,last_name,first_name,city,state,order,order_date,price
0,A100,Widget1,12.50,C01,Smith,Jeff,Auburn,AL,123.0,01/07/17,227.83
1,A100,Widget1,12.50,C01,Smith,Jeff,Auburn,AL,823.0,01/10/17,225.55
2,A109,Widget2,423.50,C01,Smith,Jeff,Auburn,AL,123.0,01/07/17,765.55
3,A109,Widget2,423.50,C04,Black,Linda,Dothan,AL,789.0,01/09/17,760.00
4,A109,Widget2,423.50,C05,Green,Howard,Greenville,AL,456.0,01/09/17,665.55
5,A200,Widget3,6.50,C01,Smith,Jeff,Auburn,AL,123.0,01/07/17,12.50
6,A200,Widget3,6.50,C03,Johnson,Cara,Birmingham,AL,1024.0,01/16/17,12.25
7,A227,Widget4,6.34,C05,Green,Howard,Greenville,AL,456.0,01/09/17,10.68
8,A300,Widget5,1850.45,C03,Johnson,Cara,Birmingham,AL,950.0,01/15/17,2650.55
9,A300,Widget5,1850.45,C06,Kholm,Genie,Norcross,GA,1223.0,01/16/17,10.25
10,A876,Widget6,3.23,C02,Jones,Kale,Mobile,AL,1552.0,01/17/17,42.75
11,A904,Widget7,7.50,C03,Johnson,Cara,Birmingham,AL,950.0,01/15/17,15.22
12,A1021,Widget8,18.55,C06,Kholm,Genie,Norcross,GA,1223.0,01/16/17,17.50
13,A1776,Widget9,127.22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
# Now, suppose that we define a mask to identify those entries
# with no orders ...
pd.isna(a['order'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
Name: order, dtype: bool

In [15]:
# ... and then apply that mask to the left-join dataset ...
a[pd.isna(a['customer_id'])][['sku', 'descr', 'cost']]
# to produce a list of SKUs that haven't been ordered

      sku    descr    cost
13  A1776  Widget9  127.22

In [16]:
# What about customers with no orders?
b = pd.merge(customers,orders, how="left")
b[pd.isna(b['order'])]

  customer_id last_name first_name      city state  order order_date
8         C07    Tester       John  Columbus    OH    NaN        NaN
9         C08     Krock     Barbra    Selina    KS    NaN        NaN

In [17]:
# orders on 01/17/17
sales[sales.order_date == '01/17/17']

,customer_id,last_name,first_name,city,state,order,order_date,sku,price,descr,cost,profit
7,C02,Jones,Kale,Mobile,AL,1552,01/17/17,A876,42.75,Widget6,3.23,39.52

In [18]:
# orders for SKU A227
sales[sales.sku == 'A227']

,customer_id,last_name,first_name,city,state,order,order_date,sku,price,descr,cost,profit
11,C05,Green,Howard,Greenville,AL,456,01/09/17,A227,10.68,Widget4,6.34,4.34

## Reading the Data Frames from csv Files

In [19]:
customers = pd.read_csv("../data/orders/customers.csv")
customers

  customer_id last_name first_name        city state
0         C01     Smith       Jeff      Auburn    AL
1         C02     Jones       Kale      Mobile    AL
2         C03   Johnson       Cara  Birmingham    AL
3         C04     Black      Linda      Dothan    AL
4         C05     Green     Howard  Greenville    AL
5         C06     Kholm      Genie    Norcross    GA
6         C07    Tester       John    Columbus    OH
7         C08     Krock     Barbra      Selina    KS
8         C09    Sinner     Thomas     Atlanta    GA

In [20]:
skus = pd.read_csv("../data/orders/skus.csv")
skus

     sku    descr     cost
0   A100  Widget1    12.50
1   A109  Widget2   423.50
2   A200  Widget3     6.50
3   A227  Widget4     6.34
4   A300  Widget5  1850.45
5   A876  Widget6     3.23
6   A904  Widget7     7.50
7  A1021  Widget8    18.55
8  A1776  Widget9   127.22

In [21]:
orders = pd.read_csv("../data/orders/orders.csv")
orders

   order customer_id order_date
0    123         C01   01/07/17
1    456         C05   01/09/17
2    789         C04   01/09/17
3    823         C01   01/10/17
4    950         C03   01/15/17
5   1024         C03   01/16/17
6   1223         C06   01/16/17
7   1552         C02   01/17/17
8    162         C09   01/07/17

In [22]:
items = pd.read_csv("../data/orders/items.csv")
items

    order    sku    price
0     123   A109   765.55
1     123   A100   227.83
2     123   A200    12.50
3     456   A109   665.55
4     456   A227    10.68
5     789   A109   760.00
6     823   A100   225.55
7     950   A300  2650.55
8     950   A904    15.22
9    1024   A200    12.25
10   1223   A300    10.25
11   1223  A1021    17.50
12   1552   A876    42.75
13    162   A227     7.75
14    162   A100    24.75